# SQL 50

Ce notebook retrace mon travail sur la plateforme leetcode qui propose 50 exercices pour s'entrainer en SQL : https://leetcode.com/studyplan/top-sql-50/

Une marque ‚úÖ indiquera que l'exercice a √©t√© r√©ussi du premier coup. 


Une marque ‚ö†Ô∏è indiquera que je dois revoir l'exercice ou que je ne l'ai pas r√©ussi du premier coup.

___________________

## üìçLes exos Select

##### 1757. Recyclable and Low Fat Products ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
 Table: Products

  ![table](images/exo1_table.png)

  product_id is the primary key (column with unique values) for this table.
  low_fats is an ENUM (category) of type ('Y', 'N') where 'Y' means this product is low fat and 'N' means it is not.
  recyclable is an ENUM (category) of types ('Y', 'N') where 'Y' means this product is recyclable and 'N' means it is not.

  Write a solution to find the ids of products that are both low fat and recyclable.

  Return the result table in any order.

  ![table](images/exo1_exemple_1.png)
</details>

<details>
  <summary>R√©ponse </summary>
  
  SELECT product_id

  FROM Products 
  
  WHERE low_fats = "Y" AND recyclable = "Y";
</details>

##### 584. Find Customer Referee ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
  Table: Customer
    
  ![table](images/exo2_table.png)
  
  In SQL, id is the primary key column for this table.
  Each row of this table indicates the id of a customer, their name, and the id of the customer who referred them.
  
  Find the names of the customer that are not referred by the customer with id = 2.
  
  Return the result table in any order.
  
  The result format is in the following example.

  


  ![table](images/exo2_exemple_2.png)
</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT name
    FROM Customer
    WHERE referee_id != 2 OR referee_id IS NULL;
</details>

##### 595. Big Countries ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
 Table: World

  ![table](images/exo3_table.jpg)

  name is the primary key (column with unique values) for this table.
  Each row of this table gives information about the name of a country, the continent to which it belongs, its area, the population, and its GDP value.
  

  A country is big if:

  it has an area of at least three million (i.e., 3000000 km2), or
  it has a population of at least twenty-five million (i.e., 25000000).
  Write a solution to find the name, population, and area of the big countries.

  Return the result table in any order.

  The result format is in the following example.

  ![table](images/exo3_exemple.jpg)
</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT name, population, area
    FROM World
    WHERE area >= 3000000 OR population >= 25000000;
</details>

##### 1148. Article Views I ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
   Table: Views

  ![table](images/exo4_table.jpg)

  There is no primary key (column with unique values) for this table, the table may have duplicate rows.
  Each row of this table indicates that some viewer viewed an article (written by some author) on some date. 
  Note that equal author_id and viewer_id indicate the same person.
    

   Write a solution to find all the authors that viewed at least one of their own articles.

   Return the result table sorted by `id` in ascending order. The result format is in the following example

  ![table](images/exo4_exemple.jpg)
</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT DISTINCT author_id as id
    FROM Views
    WHERE author_id = viewer_id
    ORDER BY id;
</details>

##### 1683. Invalid Tweets ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
   Table: Tweets

  ![table](images/exo5_table.jpg)

  tweet_id is the primary key (column with unique values) for this table.
  content consists of characters on an American Keyboard, and no other special characters.
  This table contains all the tweets in a social media app.
 

  Write a solution to find the IDs of the invalid tweets. The tweet is invalid if the number of characters used in the content of the tweet is strictly greater than `15`.

  Return the result table in any order.

  The result format is in the following example

  ![table](images/exo5_exemple.jpg)
</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT tweet_id
    FROM Tweets
    WHERE LENGTH(content)>15;
</details>

___________

## üîóBasic Joins

##### 1378. Replace Employee ID With The Unique Identifier ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
   Table: Employees

  ![table](images/exo6_table1.jpg)

  id is the primary key (column with unique values) for this table.
  Each row of this table contains the id and the name of an employee in a company.

   Table: EmployeeUNI

   ![table](images/exo6_table2.jpg)

  (id, unique_id) is the primary key (combination of columns with unique values) for this table.
  Each row of this table contains the id and the corresponding unique id of an employee in the company.

  Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.

  Return the result table in any order.

  The result format is in the following example.

  ![table](images/exo6_exemple1.jpg)
  ![table](images/exo6_exemple2.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT e.name, eu.unique_id
    FROM Employees e
    LEFT JOIN EmployeeUNI eu
    ON e.id = eu.id;
</details>

##### 1068. Product Sales Analysis I ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
   Table: Sales

  ![table](images/exo7_table1.jpg)

  (sale_id, year) is the primary key (combination of columns with unique values) of this table.
   product_id is a foreign key (reference column) to Product table.
   Each row of this table shows a sale on the product product_id in a certain year.
   Note that the price is per unit.

   Table: Product

   ![table](images/exo7_table2.jpg)

  product_id is the primary key (column with unique values) of this table.
  Each row of this table indicates the product name of each product.

  Write a solution to report the `product_name`, `year`, and `price` for each `sale_id` in the Sales table.

  Return the resulting table in any order.

  The result format is in the following example.

  ![table](images/exo7_exemple1.jpg)
  ![table](images/exo7_exemple2.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT p.product_name, s.year, s.price
    FROM Product p
    RIGHT JOIN Sales s
    ON p.product_id = s.product_id;
</details>

##### 1581. Customer Who Visited but Did Not Make Any Transactions ‚ö†Ô∏è

<details>
  <summary>Enonc√©</summary>
  
   Table: Visits

  ![table](images/exo8_table1.jpg)

  visit_id is the column with unique values for this table.
  This table contains information about the customers who visited the mall

   Table: Transaction

   ![table](images/exo8_table2.jpg)

  transaction_id is column with unique values for this table.
  This table contains information about the transactions made during the visit_id. 

  Write a solution to find the IDs of the users who visited without making any transactions and the number of times they made these types of visits.

  Return the result table sorted in any order.

  The result format is in the following example.

  ![table](images/exo8_exemple1.jpg)
  ![table](images/exo8_exemple2.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT v.customer_id, COUNT(v.visit_id) AS count_no_trans
    FROM Visits v
    LEFT JOIN Transactions t
    ON v.visit_id = t.visit_id
    WHERE t.transaction_id IS NULL
    GROUP BY v.customer_id;
</details>

##### 197. Rising Temperature ‚ö†Ô∏è

<details>
  <summary>Enonc√©</summary>
  
   Table: Weather

  ![table](images/exo9_table.jpg)

  id is the column with unique values for this table.
  There are no different rows with the same recordDate.
  This table contains information about the temperature on a certain day.

   Write a solution to find all dates' id with higher temperatures compared to its previous dates (yesterday).

   Return the result table in any order.

   The result format is in the following example.

  ![table](images/exo9_exemple.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT w.id
    FROM Weather w
    LEFT JOIN Weather w1
    ON w.recordDate = DATE_ADD(w1.recordDate, INTERVAL 1 DAY)
    WHERE w.temperature>w1.temperature;

   OU
    
    SELECT w1.id
    FROM Weather w1, Weather w2
    WHERE DATEDIFF(w1.recordDate, w2.recordDate) = 1 AND w1.temperature > w2.temperature;
</details>

##### 1661. Average Time of Process per Machine ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
   Table: Activity

  ![table](images/exo10_table.jpg)

  The table shows the user activities for a factory website.
  (machine_id, process_id, activity_type) is the primary key (combination of columns with unique values) of this table.
  machine_id is the ID of a machine.
  process_id is the ID of a process running on the machine with ID machine_id.
  activity_type is an ENUM (category) of type ('start', 'end').
  timestamp is a float representing the current time in seconds.
  'start' means the machine starts the process at the given timestamp and 'end' means the machine ends the process at the given timestamp.
  The 'start' timestamp will always be before the 'end' timestamp for every (machine_id, process_id) pair.
  It is guaranteed that each (machine_id, process_id) pair has a 'start' and 'end' timestamp.

  There is a factory website that has several machines each running the same number of processes. Write a solution to find the average time each machine takes to complete a process.

  The time to complete a process is the 'end' timestamp minus the 'start' timestamp. The average time is calculated by the total time to complete every process on the machine divided by the number of processes that were run.

  The resulting table should have the machine_id along with the average time as processing_time, which should be rounded to 3 decimal places.

  Return the result table in any order.

  The result format is in the following example.

  ![table](images/exo10_exemple1.jpg)

  ![table](images/exo10_exemple2.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT a.machine_id, ROUND(AVG(a2.timestamp-a.timestamp),3) as processing_time
    FROM Activity a, Activity a2
    WHERE a.machine_id = a2.machine_id AND a.activity_type = 'start' AND a2.activity_type = 'end'
    GROUP BY machine_id

   OU
    
    # Write your MySQL query statement below
    SELECT a.machine_id, ROUND(AVG(b.timestamp-a.timestamp),3) AS processing_time
    FROM Activity a
    JOIN Activity b
    ON a.machine_id = b.machine_id
    AND a.process_id = b.process_id
    AND a.activity_type = 'start'
    AND b.activity_type = 'end'
    GROUP BY machine_id;
</details>

##### 577. Employee Bonus ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
   Table: Employee

  ![table](images/exo11_table1.jpg)

  empId is the column with unique values for this table.
  Each row of this table indicates the name and the ID of an employee in addition to their salary and the id of their manager.

    Table: Bonus

  ![table](images/exo11_table2.jpg)

  empId is the column of unique values for this table.
  empId is a foreign key (reference column) to empId from the Employee table.
  Each row of this table contains the id of an employee and their respective bonus.

   Write a solution to report the name and bonus amount of each employee with a bonus less than 1000.

   Return the result table in any order.

   The result format is in the following example.

  ![table](images/exo11_exemple.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT e.name, b.bonus
    FROM Employee e
    LEFT JOIN Bonus b
    ON e.empId = b.empId
    WHERE b.bonus < 1000 OR b.bonus IS NULL;

</details>

##### 1280. Students and Examinations ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
   Table: Students

  ![table](images/exo12_table1.jpg)

  student_id is the primary key (column with unique values) for this table.
  Each row of this table contains the ID and the name of one student in the school.

    Table: Subjects

  ![table](images/exo12_table2.jpg)

  subject_name is the primary key (column with unique values) for this table.
  Each row of this table contains the name of one subject in the school.

  Table: Examinations

  ![table](images/exo12_table3.jpg)

  There is no primary key (column with unique values) for this table. It may contain duplicates.
  Each student from the Students table takes every course from the Subjects table.
  Each row of this table indicates that a student with ID student_id attended the exam of subject_name.

   Write a solution to find the number of times each student attended each exam.

   Return the result table ordered by student_id and subject_name.

   The result format is in the following example.

  ![table](images/exo12_example1.jpg)

  ![table](images/exo12_example2.jpg)

  ![table](images/exo12_example3.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT s.student_id,s.student_name,su.subject_name,COUNT(e.student_id) AS attended_exams
    FROM Students s
    CROSS JOIN Subjects su
    LEFT JOIN Examinations e
    ON s.student_id = e.student_id AND su.subject_name = e.subject_name
    GROUP BY s.student_id, s.student_name, su.subject_name
    ORDER BY s.student_id, su.subject_name;

</details>

##### 570. Managers with at Least 5 Direct Reports ‚ö†Ô∏è

<details>
  <summary>Enonc√©</summary>
  
   Table: Employee

  ![table](images/exo13_table.jpg)

  id is the primary key (column with unique values) for this table.
  Each row of this table indicates the name of an employee, their department, and the id of their manager.
  If managerId is null, then the employee does not have a manager.
  No employee will be the manager of themself. 


   Write a solution to find managers with at least five direct reports.

   Return the result table in any order.

   The result format is in the following example.

  ![table](images/exo13_exemple.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT e.name
    FROM Employee e
    JOIN Employee m
    ON e.id = m.managerId
    GROUP BY e.id, e.name
    HAVING COUNT(e.id) >= 5;

</details>

##### 1934. Confirmation Rate

<details>
  <summary>Enonc√©</summary>
  
   Table: Signups

  ![table](images/exo14_table1.jpg)

  user_id is the column of unique values for this table.
  Each row contains information about the signup time for the user with ID user_id.

  Table: Confirmations

  ![table](images/exo14_table2.jpg)

  (user_id, time_stamp) is the primary key (combination of columns with unique values) for this table.
  user_id is a foreign key (reference column) to the Signups table.
  action is an ENUM (category) of the type ('confirmed', 'timeout')
  Each row of this table indicates that the user with ID user_id requested a confirmation message at time_stamp and that confirmation message was either confirmed ('confirmed') or expired without confirming ('timeout').

   The confirmation rate of a user is the number of 'confirmed' messages divided by the total number of requested confirmation messages. The confirmation rate of a user that did not request any confirmation messages is 0. Round the confirmation rate to two decimal places.

   Write a solution to find the confirmation rate of each user.

   Return the result table in any order.

   The result format is in the following example.

  ![table](images/exo14_example1.jpg)

  ![table](images/exo14_example2.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT 
    s.user_id, 
    COALESCE(ROUND(
        COALESCE(SUM(CASE WHEN c.action = 'confirmed' THEN 1 ELSE 0 END), 0) 
        / NULLIF(COUNT(c.action), 0), 
        2
    ),0) AS confirmation_rate
    FROM 
        Signups s
    LEFT JOIN 
        Confirmations c
    ON 
        s.user_id = c.user_id
    GROUP BY 
        s.user_id;

   OR

    SELECT s.user_id, round(avg(if(c.action="confirmed",1,0)),2) as confirmation_rate
    FROM Signups as s 
    LEFT JOIN Confirmations as c 
    ON s.user_id= c.user_id 
    GROUP BY user_id;

</details>

______________

## Basic Aggregate Functions

##### 620. Not Boring Movies

<details>
  <summary>Enonc√©</summary>
  
   Table: Cinema

  ![table](images/exo15_table.jpg)

  Write a solution to report the movies with an odd-numbered ID and a description that is not "boring".

  Return the result table ordered by rating in descending order.

  The result format is in the following example.

  ![table](images/exo15_exemple.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT *
    FROM Cinema
    WHERE description!="boring" 
    HAVING id%2=1
    ORDER BY rating DESC
    

</details>

##### 1251. Average Selling Price

<details>
  <summary>Enonc√©</summary>
  
   Table: Prices

  ![table](images/exo16_table1.jpg)

  (product_id, start_date, end_date) is the primary key (combination of columns with unique values) for this table.
  Each row of this table indicates the price of the product_id in the period from start_date to end_date.
  For each product_id there will be no two overlapping periods. That means there will be no two intersecting periods for the same product_id.

  Table: UnitsSold

  ![table](images/exo16_table2.jpg)

  This table may contain duplicate rows.
  Each row of this table indicates the date, units, and product_id of each product sold. 

   Write a solution to find the average selling price for each product. average_price should be rounded to 2 decimal places. If a product does not have any sold units, its average selling price is assumed to be 0.

    Return the result table in any order.

    The result format is in the following example.

  ![table](images/exo16_exemple1.jpg)

  ![table](images/exo16_exemple2.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT 
        p.product_id, 
        ROUND(IF(SUM(s.units) IS NULL, 0, SUM(s.units*p.price)/SUM(s.units)), 2) as average_price
    FROM Prices p 
    LEFT JOIN UnitsSold s 
    ON p.product_id = s.product_id AND s.purchase_date BETWEEN p.start_date AND p.end_date
    GROUP BY p.product_id;
    

</details>

##### 1075. Project Employees I

<details>
  <summary>Enonc√©</summary>
  
   Table: Project

  ![table](images/exo17_table1.jpg)

  Table: Employee

  ![table](images/exo17_table2.jpg)

  Write an SQL query that reports the average experience years of all the employees for each project, rounded to 2 digits.

  Return the result table in any order.

  The query result format is in the following example.
  ![table](images/exo17_exemple1.jpg)

  ![table](images/exo17_exemple2.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT p.project_id, ROUND(AVG(e.experience_years), 2) as average_years
    FROM Project p 
    LEFT JOIN Employee e
    ON p.employee_id = e.employee_id
    GROUP BY p.project_id;
    

</details>

##### 1633. Percentage of Users Attended a Contest

<details>
  <summary>Enonc√©</summary>
  
   Table: Users

  ![table](images/exo18_table1.jpg)

  Table: Register

  ![table](images/exo18_table2.jpg)

  Write a solution to find the percentage of the users registered in each contest rounded to two decimals.

  Return the result table ordered by percentage in descending order. In case of a tie, order it by contest_id in ascending order.

  The result format is in the following example.

  ![table](images/exo18_exemple1.jpg)

  ![table](images/exo18_exemple2.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT r.contest_id, ROUND((COUNT(r.contest_id)/(SELECT COUNT(*) FROM Users))* 100, 2) as percentage
    FROM Register r
    LEFT JOIN Users u
    ON r.user_id = u.user_id
    GROUP BY r.contest_id
    ORDER BY percentage DESC, r.contest_id ASC;
    

</details>

##### 1211. Queries Quality and Percentage

<details>
  <summary>Enonc√©</summary>
  
   Table: Queries

  ![table](images/exo19_table1.jpg)

  We define query quality as:

  The average of the ratio between query rating and its position.

  We also define poor query percentage as:

  The percentage of all queries with rating less than 3.

  Write a solution to find each query_name, the quality and poor_query_percentage.

  Both quality and poor_query_percentage should be rounded to 2 decimal places.

  Return the result table in any order.

  The result format is in the following example.

  ![table](images/exo19_exemple1.jpg)

  ![table](images/exo19_exemple2.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT 
    query_name, 
    ROUND(AVG(rating/position),2) as quality,
    ROUND((SUM(CASE WHEN rating < 3 THEN 1 ELSE 0 END) * 100.0) / COUNT(*), 2)
    as poor_query_percentage
    FROM Queries
    GROUP BY query_name;
    

</details>

##### 1193. Monthly Transactions I

<details>
  <summary>Enonc√©</summary>
  
   Table: Queries

  ![table](images/exo20_table1.jpg)

  Write an SQL query to find for each month and country, the number of transactions and their total amount, the number of approved transactions and their total amount.

  Return the result table in any order.

  The query result format is in the following example.

  ![table](images/exo20_exemple1.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT 
      DATE_FORMAT(trans_date, '%Y-%m') as month,   
      country, 
      COUNT(id) as trans_count, 
      SUM(CASE WHEN state="approved" THEN 1 ELSE 0 END) as approved_count, 
      SUM(amount) as trans_¬µtotal_amount, 
      SUM(CASE WHEN state="approved" THEN amount ELSE 0 END) as approved_total_amount 
    FROM Transactions
    GROUP BY month, country;
    

</details>

##### 1174. Immediate Food Delivery II

<details>
  <summary>Enonc√©</summary>
  
   Table: Delivery

  ![table](images/exo21_table1.jpg)

  If the customer's preferred delivery date is the same as the order date, then the order is called immediate; otherwise, it is called scheduled.

  The first order of a customer is the order with the earliest order date that the customer made. It is guaranteed that a customer has precisely one first order.

  Write a solution to find the percentage of immediate orders in the first orders of all customers, rounded to 2 decimal places.

  The result format is in the following example.

  ![table](images/exo21_exemple1.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT 
        ROUND(AVG(order_date = customer_pref_delivery_date)*100, 2) AS immediate_percentage
    FROM Delivery
    WHERE (customer_id, order_date) IN (
        SELECT customer_id, min(order_date) 
        FROM Delivery
        GROUP BY customer_id);
    

</details>

##### 550. Game Play Analysis IV

<details>
  <summary>Enonc√©</summary>
  
   Table: Activity

  ![table](images/exo22_table1.jpg)

  Write a solution to report the fraction of players that logged in again on the day after the day they first logged in, rounded to 2 decimal places. In other words, you need to count the number of players that logged in for at least two consecutive days starting from their first login date, then divide that number by the total number of players.

  The result format is in the following example.

 

  ![table](images/exo22_exemple1.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    # First, let's store the first login date of each player.
    WITH temp AS (
        SELECT player_id, MIN(event_date) AS first_login_date
        FROM Activity 
        GROUP BY player_id
    )

    # Calculate the fraction of players who logged in exactly one day after their first login.
    SELECT 
        ROUND(
            SUM(DATEDIFF(a.event_date, t.first_login_date) = 1) / COUNT(DISTINCT a.player_id), 2
        ) AS fraction
    FROM Activity a
    JOIN temp t ON a.player_id = t.player_id;
    

</details>

## Sorting and Grouping

##### 2356. Number of Unique Subjects Taught by Each Teacher ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
   Table: Teacher

  ![table](images/exo23_table1.jpg)

  Write a solution to calculate the number of unique subjects each teacher teaches in the university.

  Return the result table in any order.

  The result format is shown in the following example.

 

  ![table](images/exo23_exemple1.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT teacher_id, COUNT(DISTINCT subject_id) as cnt
    FROM Teacher
    GROUP BY teacher_id;
    

</details>

##### 1141. User Activity for the Past 30 Days I ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
   Table: Teacher

  ![table](images/exo24_table1.jpg)

  Write a solution to find the daily active user count for a period of 30 days ending 2019-07-27 inclusively. A user was active on someday if they made at least one activity on that day.

  Return the result table in any order.

  The result format is in the following example.

 

  ![table](images/exo24_exemple1.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT activity_date as day, COUNT(DISTINCT user_id) as active_users
    FROM Activity
    WHERE 
        (
        activity_type = "scroll_down" 
        OR activity_type = "send_message" 
        OR activity_type ="open_session" 
        OR activity_type ="end_session"
        ) 
        AND 
        DATEDIFF("2019-07-27", activity_date)<DATEDIFF("2019-07-27", "2019-06-28")+1
        AND activity_date <= "2019-07-27"
    GROUP BY day;
    

</details>

##### 1070. Product Sales Analysis III

<details>
  <summary>Enonc√©</summary>
  
   Table: Sales

  ![table](images/exo25_table1.jpg)

   Table: Product

  ![table](images/exo25_table2.jpg)

  Write a solution to select the product id, year, quantity, and price for the first year of every product sold.

  Return the resulting table in any order.

  The result format is in the following example.

 

 

  ![table](images/exo25_exemple1.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
  Avec sous-requ√™te :

      select product_id, year as first_year, quantity, price 
      from sales where (product_id, year) in (
          select product_id, min(year)
          from sales
          group by product_id
)



  Avec CTE :

        WITH FirstYear AS (
        SELECT product_id, MIN(year) AS first_year
        FROM Sales
        GROUP BY product_id
            )

        SELECT s.product_id, s.year as first_year, s.quantity, s.price
        FROM Sales s 
        JOIN FirstYear n
        ON s.product_id = n.product_id AND s.year = n.first_year
        ORDER BY first_year
    

</details>

##### 596. Classes More Than 5 Students ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
   Table: Courses

  ![table](images/exo26_table1.jpg)
  
  Write a solution to find all the classes that have at least five students.

  Return the result table in any order.

  The result format is in the following example.

 

 

  ![table](images/exo26_exemple1.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT class
    FROM Courses
    GROUP BY class
    HAVING COUNT(class)>=5;

</details>

##### 1729. Find Followers Count ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
   Table: Followers

  ![table](images/exo27_table1.jpg)
  
  Write a solution to find all the classes that have at least five students.

  Return the result table in any order.

  The result format is in the following example.


  ![table](images/exo27_exemple1.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT user_id, COUNT(follower_id) AS followers_count
    FROM Followers 
    GROUP BY user_id
    ORDER BY user_id;

</details>

##### 619. Biggest Single Number  ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
   Table: MyNumbers

  ![table](images/exo28_table1.jpg)
  
  A single number is a number that appeared only once in the MyNumbers table.

  Find the largest single number. If there is no single number, report null.

  The result format is in the following example.


  ![table](images/exo28_exemple1.jpg)

  ![table](images/exo28_exemple2.jpg)
</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT MAX(num) AS num
    FROM (
        SELECT num
        FROM MyNumbers
        GROUP BY num
        HAVING COUNT(num) = 1
    ) AS unique_numbers;

    OR

    SELECT num 
    FROM (
        SELECT num 
        FROM MyNumbers
        GROUP BY num
        HAVING COUNT(num) = 1
        UNION ALL
        SELECT NULL) AS combined_results
    ORDER BY num DESC
    LIMIT 1;

</details>

##### 1045. Customers Who Bought All Products

<details>
  <summary>Enonc√©</summary>
  
  

  ![table](images/exo29_table1.jpg)
  
  Write a solution to report the customer ids from the Customer table that bought all the products in the Product table.

  Return the result table in any order.

  The result format is in the following example.


  ![table](images/exo29_exemple1.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
  
    SELECT c.customer_id
    FROM Customer c
    JOIN Product p
    ON c.product_key = p.product_key
    GROUP BY c.customer_id
    HAVING COUNT(DISTINCT c.product_key) = (SELECT COUNT(*) FROM Product);


</details>

## Advanced Select and Joins

##### 1731. The Number of Employees Which Report to Each Employee ‚úÖ

<details>
  <summary>Enonc√©</summary>
  
  

  ![table](images/exo30_table1.jpg)
  
  For this problem, we will consider a manager an employee who has at least 1 other employee reporting to them.

  Write a solution to report the ids and the names of all managers, the number of employees who report directly to them, and the average age of the reports rounded to the nearest integer.

  Return the result table ordered by employee_id.

  The result format is in the following example.


  ![table](images/exo30_exemple1.jpg)


  ![table](images/exo30_exemple2.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
    
    Ma solution :

    SELECT e.employee_id, e.name, 
    (SELECT COUNT(e2.reports_to) FROM Employees e2 WHERE e2.reports_to = e.employee_id) AS reports_count, 
    ROUND((SELECT AVG(e3.age) FROM Employees e3 WHERE e3.reports_to = e.employee_id)  , 0) AS average_age
    FROM Employees e
    JOIN Employees e1
    ON e.employee_id = e1.employee_id
    GROUP BY e.employee_id
    HAVING reports_count > 0
    ORDER BY e.employee_id;

    Solution optimis√©e : 

    SELECT 
    e1.employee_id,
    e1.name,
    count(e2.reports_to) as reports_count,
    round(avg(e2.age)) as average_age 
    FROM employees e1 
    JOIN employees e2 ON e1.employee_id=e2.reports_to 
    WHERE e2.reports_to is not null 
    GROUP BY e1.employee_id 
    ORDER BY e1.employee_id;

</details>

##### 1789. Primary Department for Each Employee

<details>
  <summary>Enonc√©</summary>
  
  

  ![table](images/exo31_table1.jpg)
  
  Employees can belong to multiple departments. When the employee joins other departments, they need to decide which department is their primary department. Note that when an employee belongs to only one department, their primary column is 'N'.

  Write a solution to report all the employees with their primary department. For employees who belong to one department, report their only department.

  Return the result table in any order.

  The result format is in the following example.


  ![table](images/exo31_exemple1.jpg)

</details>

<details>
  <summary>R√©ponse </summary>
    
    Ma solution :

    SELECT employee_id, department_id
    FROM Employee
    WHERE primary_flag = "Y" OR employee_id IN (SELECT employee_id 
                                                FROM Employee
                                                GROUP BY employee_id
                                                HAVING COUNT(employee_id)=1)

</details>